df overview,  determine problems and key questions to perform task, rename columns,  dealing with duplicates , missed data , timestamp  and screen record test

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns #visualisation
import matplotlib.pyplot as plt #visualisation
%matplotlib inline 
sns.set(color_codes=True)

In [2]:
mvp=["n.a.","?","NA","n/a", "na", "--"]

In [3]:
df=pd.read_csv("Salary_Survey.csv", na_values=mvp)

In [4]:
df.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",...,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,...,5-7 years,5-7 years,Master's degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Non-binary,NaN,NaN,NaN,NaN,NaN,NaN
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,...,2 - 4 years,2 - 4 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
df.shape

(28178, 23)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28178 entries, 0 to 28177
Data columns (total 23 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28085 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28085 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         28011 non-null  object
 3   Job title                                                                                                                                                                                                                             28083 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7266 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28085 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20780 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28085 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        208 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3044 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28084 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23059 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27998 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28085 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28085 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27863 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27914 non-null  object
 17  Unnamed: 17                                                                                                                                                                                                                           0 non-null      float64
 18  Unnamed: 18                                                                                                                                                                                                                           0 non-null      float64
 19  Unnamed: 19                                                                                                                                                                                                                           0 non-null      float64
 20  Unnamed: 20                                                                                                                                                                                                                           0 non-null      float64
 21  Unnamed: 21                                                                                                                                                                                                                           0 non-null      float64
 22  Unnamed: 22                                                                                                                                                                                                                           0 non-null      float64
dtypes: float64(7), object(16)
memory usage: 4.9+ MB

In [7]:
non_null_counts = df.count()
print(non_null_counts)

Timestamp                                                                                                                                                                                                                               28085
How old are you?                                                                                                                                                                                                                        28085
What industry do you work in?                                                                                                                                                                                                           28011
Job title                                                                                                                                                                                                                               28083
If your job title needs additional context, please clarify here:                                                                                                                                                                         7266
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)    28085
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          20780
Please indicate the currency                                                                                                                                                                                                            28085
If "Other," please indicate the currency here:                                                                                                                                                                                            208
If your income needs additional context, please provide it here:                                                                                                                                                                         3044
What country do you work in?                                                                                                                                                                                                            28084
If you're in the U.S., what state do you work in?                                                                                                                                                                                       23059
What city do you work in?                                                                                                                                                                                                               27998
How many years of professional work experience do you have overall?                                                                                                                                                                     28085
How many years of professional work experience do you have in your field?                                                                                                                                                               28085
What is your highest level of education completed?                                                                                                                                                                                      27863
What is your gender?                                                                                                                                                                                                                    27914
Unnamed: 17                                                                                                                                                                                                                                 0
Unnamed: 18                                                                                                                                                                                                                                 0
Unnamed: 19                                                                                                                                                                                                                                 0
Unnamed: 20                                                                                                                                                                                                                                 0
Unnamed: 21                                                                                                                                                                                                                                 0
Unnamed: 22                                                                                                                                                                                                                                 0
dtype: int64

In [8]:
#no non-null values -all values in the columns 17-22 are missing or null,we can delete them
# rename titles for columns change text to number, number to relevant title
df.columns = range(len(df.columns))

In [9]:
#lets replase numbers for text format to rename columns 
new_column_names = ["column_" + str(i) for i in range(len(df.columns))]
df.columns = new_column_names

In [10]:
df.head()

,column_0,column_1,column_2,column_3,column_4,column_5,column_6,column_7,column_8,column_9,...,column_13,column_14,column_15,column_16,column_17,column_18,column_19,column_20,column_21,column_22
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,...,5-7 years,5-7 years,Master's degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Non-binary,NaN,NaN,NaN,NaN,NaN,NaN
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,...,2 - 4 years,2 - 4 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,...,8 - 10 years,5-7 years,College degree,Woman,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
#take down colimns without values
df.drop(columns=['column_17','column_18','column_19','column_20','column_21','column_22'], inplace=True)

In [12]:
#rename columns 
df = df.rename(columns={"column_0":"Timestump","column_1": "Age","column_16":"Gender","column_15": "highest education level"})

In [13]:
df = df.rename(columns={"column_2":"Industry","column_3": "Job title","column_4":"Job context","column_5":"Annual Salary","column_6":"Bonus","column_7":"Currency","column_8":"Currency other","column_9":"Income context"})

In [14]:
df = df.rename(columns={"column_10":"Country","column_11": "State","column_12":"City","column_13": "Work_Exp","column_14": "Rel_Exp"})

In [15]:
#detecting duplicate rows
duplicate_rows_df = df[df.duplicated()]
print("number of duplicate rows: ", duplicate_rows_df.shape)

number of duplicate rows:  (92, 17)

In [16]:
# Print duplicate rows with null values
print(duplicate_rows_df[duplicate_rows_df.isnull().any(axis=1)])

      Timestump  Age Industry Job title Job context Annual Salary  Bonus  \
28086       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28087       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28088       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28089       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28090       NaN  NaN      NaN       NaN         NaN           NaN    NaN
...         ...  ...      ...       ...         ...           ...    ...
28173       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28174       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28175       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28176       NaN  NaN      NaN       NaN         NaN           NaN    NaN
28177       NaN  NaN      NaN       NaN         NaN           NaN    NaN

      Currency Currency other Income context Country State City Work_Exp  \
28086      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28087      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28088      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28089      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28090      NaN            NaN            NaN     NaN   NaN  NaN      NaN
...        ...            ...            ...     ...   ...  ...      ...
28173      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28174      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28175      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28176      NaN            NaN            NaN     NaN   NaN  NaN      NaN
28177      NaN            NaN            NaN     NaN   NaN  NaN      NaN

      Rel_Exp highest education level Gender
28086     NaN                     NaN    NaN
28087     NaN                     NaN    NaN
28088     NaN                     NaN    NaN
28089     NaN                     NaN    NaN
28090     NaN                     NaN    NaN
...       ...                     ...    ...
28173     NaN                     NaN    NaN
28174     NaN                     NaN    NaN
28175     NaN                     NaN    NaN
28176     NaN                     NaN    NaN
28177     NaN                     NaN    NaN

[92 rows x 17 columns]

In [17]:
#we can exclude now  93 duplicates rows ,as we did for columns before
# drop all rows with NaN values - we can lost almost all data ,
df = df.iloc[:-93]

In [18]:
#review 
df.tail(4)

,Timestump,Age,Industry,Job title,Job context,Annual Salary,Bonus,Currency,Currency other,Income context,Country,State,City,Work_Exp,Rel_Exp,highest education level,Gender
28081,9/25/2024 21:34:43,45-54,Education (Primary/Secondary),Curriculum Writer,I am a freelance contract curriculum writer fo...,70000,0.0,USD,NaN,NaN,United States,South Carolina,Bennettsville,21 - 30 years,21 - 30 years,Master's degree,Woman
28082,9/30/2024 10:52:30,55-64,Government and Public Administration,Clerical Officer,NaN,28600,NaN,EUR,NaN,NaN,Ireland,NaN,Dublin,21 - 30 years,1 year or less,"Professional degree (MD, JD, etc.)",Man
28083,10/4/2024 13:05:24,18-24,Computing or Tech,Software Engineering Co-Op,I was an Intern,56160,0.0,USD,NaN,NaN,United States,Rhode Island,Jhonston,1 year or less,1 year or less,College degree,Man
28084,10/7/2024 5:17:56,65 or over,Social networks,Content creator,NaN,2000000,NaN,USD,NaN,NaN,Taiwan,"Utah, Wisconsin",Milwaukee,41 years or more,2 - 4 years,PhD,Non-binary

In [19]:
# identifying columns with missing data and deciding how to handle  missing values
print(df.isnull().sum())

Timestump                      0
Age                            0
Industry                      74
Job title                      2
Job context                20819
Annual Salary                  0
Bonus                       7305
Currency                       0
Currency other             27877
Income context             25041
Country                        1
State                       5026
City                          87
Work_Exp                       0
Rel_Exp                        0
highest education level      222
Gender                       171
dtype: int64

# determine  target variable(“Annual salary” ), dropping irrelevant columns,  # Main target - annual salary, year mention in a title ,values in a Timestump nonsuffisient impact , 'Job context'- most of the data missed  and   similar for  "indastry  and Job title, categotical variable ' Income context' do not impact  numerical data in Target variable

#

In [20]:
#take down non relevant to the target variable columns Timestamp ,'Job context','Income context'
# Main target - annual salary, year mention in a title , 
df.drop(columns=['Timestump','Job context','Income context','Currency other'], inplace=True)

In [21]:
#assuming 171 missed values in a column "Gender",replase them with 'No Gender ' 

df['Gender'] = df['Gender'].fillna('No Gender ')

In [22]:
# identifying  unique values in a  column
df['Gender'].unique()

array(['Woman', 'Non-binary', 'Man', 'No Gender ',
       'Other or prefer not to answer', 'Prefer not to answer'],
      dtype=object)

In [23]:
#Replace with "NA" (No answer) non gender related  categories (missing values)  using the replace() method:
df['Gender'] = df['Gender'].replace(['Prefer not to answer', 'Other or prefer not to answer'], 'Other')

In [24]:
#identifying unique duplicates in a columns
df.drop_duplicates('Gender', keep='first')

,Age,Industry,Job title,Annual Salary,Bonus,Currency,Country,State,City,Work_Exp,Rel_Exp,highest education level,Gender
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary
5,25-34,Education (Higher Education),Scholarly Publishing Librarian,"62,000",NaN,USD,USA,New Hampshire,Hanover,8 - 10 years,2 - 4 years,Master's degree,Man
171,25-34,Government and Public Administration,Program Analyst,"117,500",1500.0,USD,USA,NaN,Washington DC,8 - 10 years,5-7 years,Master's degree,No Gender
321,35-44,Computing or Tech,Software Engineer,"156,000",189000.0,USD,United States,Massachusetts,Metro Boston,21 - 30 years,21 - 30 years,Master's degree,Other

In [25]:
#standartise "'highest education level" variables 
#replace missing values,rename all   confused values with most close unic realted names
#replace missing values with (Not applicable ')  "NA"
df['highest education level'] = df['highest education level'].fillna('NA')

In [26]:
#  determine unique categories in Higest  Education column
array = df["highest education level"].unique() 
print(array)

["Master's degree" 'College degree' 'PhD' 'NA' 'Some college'
 'High School' 'Professional degree (MD, JD, etc.)']

In [27]:
#rename values
df['highest education level'] = df['highest education level'].replace(['Professional degree (MD, JD, etc.)','Master\'s degree' ], 'MD')

In [28]:
#rename values
df['highest education level'] = df['highest education level'].replace(['Some college','College degree'], 'CD')

In [29]:
# Determine the distribution of categorical variables 
# Frequency table for 'highest education'Education_distribution = df['highest education level'].value_counts()
Education_distribution = df['highest education level'].value_counts()
print(Education_distribution)

CD             15601
MD             10196
PhD             1427
High School      639
NA               222
Name: highest education level, dtype: int64

#create a new variable "Demographics"   that could provide ifferent approach to analising releation betveen "Gender" ,Education"   and Salary

In [30]:
#  'df' with columns 'Highest Education Level' and 'Gender'
df['Demographics'] = df['highest education level'] + '_' + df['Gender']

In [31]:
# identifying  categories/values in a new   column
df['Demographics'].unique()

array(['MD_Woman', 'CD_Non-binary', 'CD_Woman', 'MD_Man', 'PhD_Woman',
       'CD_Man', 'NA_Woman', 'MD_Non-binary', 'High School_Man',
       'PhD_Man', 'High School_Woman', 'MD_No Gender ', 'PhD_Non-binary',
       'High School_Non-binary', 'MD_Other', 'PhD_Other', 'CD_No Gender ',
       'CD_Other', 'NA_No Gender ', 'NA_Man', 'High School_Other',
       'PhD_No Gender ', 'NA_Other', 'NA_Non-binary',
       'High School_No Gender '], dtype=object)

In [32]:
#from this poit it is possible to see repation betveen Gender and Education
# Frequency table for 'Job title'
Demographics_distribution = df['Demographics'].value_counts()

print(Demographics_distribution)

CD_Woman                  11581
MD_Woman                   8209
CD_Man                     3323
MD_Man                     1599
PhD_Woman                  1097
CD_Non-binary               468
High School_Woman           358
PhD_Man                     277
High School_Man             250
MD_Non-binary               232
CD_Other                    177
NA_Woman                    131
MD_Other                     93
MD_No Gender                 63
CD_No Gender                 52
NA_Man                       44
NA_No Gender                 41
PhD_Non-binary               24
High School_Non-binary       20
PhD_Other                    17
PhD_No Gender                12
High School_Other             8
NA_Other                      4
High School_No Gender         3
NA_Non-binary                 2
Name: Demographics, dtype: int64

In [33]:
#  lets drop single variables 
df.drop(columns=['highest education level','Gender'], inplace=True)

In [34]:
#review updated df 
df.head(2)

,Age,Industry,Job title,Annual Salary,Bonus,Currency,Country,State,City,Work_Exp,Rel_Exp,Demographics
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,MD_Woman
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,CD_Non-binary

#clean data for range columns ‘Age’ , ‘Work Exp’ , ‘ Rel_exp’ :extract text, find unique groups /

In [35]:
# identifying columns with missing data in updated df
print(df.isnull().sum())

Age                 0
Industry           74
Job title           2
Annual Salary       0
Bonus            7305
Currency            0
Country             1
State            5026
City               87
Work_Exp            0
Rel_Exp             0
Demographics        0
dtype: int64

In [36]:
#replace missing values with (Unknown')/'NA'
#  for missed values 'City',replace with equal value from 'Country'
df['Industry'] = df['Industry'].fillna('Unknown')
df['Job title'] = df['Job title'].fillna('Unknown')
df['Bonus']=df['Bonus'].fillna('NA')
df['Country']=df['Country'].fillna('Unknown')
df['State']=df['State'].fillna('NA')
df['City']=df['City'].fillna(df['Country'])

In [37]:
#identifying unique duplicates in a columns
#review updated DF
df.drop_duplicates('Industry', keep='first')

,Age,Industry,Job title,Annual Salary,Bonus,Currency,Country,State,City,Work_Exp,Rel_Exp,Demographics
0,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,MD_Woman
1,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NA,Cambridge,8 - 10 years,5-7 years,CD_Non-binary
2,25-34,"Accounting, Banking & Finance",Marketing Specialist,"34,000",NA,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,CD_Woman
3,25-34,Nonprofits,Program Manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,CD_Woman
6,25-34,Publishing,Publishing Assistant,"33,000",2000.0,USD,USA,South Carolina,Columbia,2 - 4 years,2 - 4 years,CD_Woman
...,...,...,...,...,...,...,...,...,...,...,...,...
27987,65 or over,Plumbing,Manager,30000,10000.0,ZAR,South Africa,NA,Johannesburg,41 years or more,41 years or more,High School_Man
27996,18-24,I'm currently a student and don't have a job,Unknown,0,0.0,USD,U.S.A,Pennsylvania,U.S.A,2 - 4 years,2 - 4 years,CD_Man
28020,25-34,Student,Student,0,0.0,USD,US,Illinois,US,1 year or less,1 year or less,CD_Other
28024,25-34,Wine & Spirits,Marketing Manager,105000,5000.0,USD,U.S.,California,Napa,5-7 years,5-7 years,CD_Woman
28084,65 or over,Social networks,Content creator,2000000,NA,USD,Taiwan,"Utah, Wisconsin",Milwaukee,41 years or more,2 - 4 years,PhD_Non-binary

In [38]:
#review updated df
print(df.isnull().sum())

Age              0
Industry         0
Job title        0
Annual Salary    0
Bonus            0
Currency         0
Country          0
State            0
City             0
Work_Exp         0
Rel_Exp          0
Demographics     0
dtype: int64

In [39]:
# identifying  categories/values in a'Work_Exp' column
df['Work_Exp'].unique()

array(['5-7 years', '8 - 10 years', '2 - 4 years', '21 - 30 years',
       '11 - 20 years', '1 year or less', '41 years or more',
       '31 - 40 years'], dtype=object)

In [40]:
# identifying  number of unoque  values in 'Industry'
unique_industries = df['Industry'].nunique()
print("Number of unique industries:", unique_industries)

Number of unique industries: 1221

In [41]:
# identifying  categories/values in a targeted  variable 'Annual Salary' column
df['Annual Salary'].unique()

array(['55,000', '54,600', '34,000', ..., '7000', '37741', '53060'],
      dtype=object)

In [42]:
# filter DF , rows where the 'Annual Salary'  does not contain the values '1', '00', or '0'.
df = df[~df['Annual Salary'].isin(['1', '00', '0'])]

In [43]:
#review lowest output for calary
print(df['Annual Salary'].tail(5))

28080     117000
28081      70000
28082      28600
28083      56160
28084    2000000
Name: Annual Salary, dtype: object

In [44]:
#review unique values for column "Currency","Country"
df["Currency"].unique()

array(['USD', 'GBP', 'CAD', 'EUR', 'AUD/NZD', 'Other', 'CHF', 'ZAR',
       'SEK', 'HKD', 'JPY'], dtype=object)

In [45]:
# Frequency table for 'Job title'
Country_distribution = df['Country'].value_counts()

print(Country_distribution)

United States                                8996
USA                                          7934
US                                           2608
Canada                                       1570
United States                                 667
                                             ...
Cote d'Ivoire                                   1
Sri lanka                                       1
From Romania, but for an US based company       1
Somalia                                         1
Burma                                           1
Name: Country, Length: 377, dtype: int64

In [46]:
#replase all missing values in remain columns
# removing all rows with missing values could change DF reading results 
df.fillna('NA', inplace=True)

In [47]:
#Lets ordering Countryes titles 
#Rename all values with US ,Unated STates   as "USA"

df_filtered = df[df['Country'].str.startswith('US','Unated STates' )]
us_distribution = df_filtered.value_counts()
print(us_distribution)

Age       Industry                     Job title                                        Annual Salary  Bonus    Currency  Country  State                 City                 Work_Exp       Rel_Exp         Demographics
25-34     Restaurant                   Service Manager                                  55,000         0.0      USD       US       California            San Jose             8 - 10 years   2 - 4 years     CD_Non-binary    3
35-44     Computing or Tech            Director of IT                                   175,000        5000.0   USD       USA      California            San Francisco        21 - 30 years  11 - 20 years   CD_Man           3
25-34     Business or Consulting       Ops Associate                                    119,000        NA       USD       US       New York              NY                   2 - 4 years    2 - 4 years     CD_Woman         2
55-64     Nonprofits                   Director of HR                                   97,000         NA       USD       USA      Montana               Missoula             21 - 30 years  21 - 30 years   MD_Woman         2
25-34     Art & Design                 Executive Assistant                              72,500         7000.0   USD       USA      New York              New York             5-7 years      5-7 years       CD_Woman         2
                                                                                                                                                                                                                             ..
          Marketing, Advertising & PR  Logistics Manager                                70,000         NA       USD       USA      Kentucky              Louisville           2 - 4 years    1 year or less  CD_Woman         1
                                       Manager                                          75,000         5000.0   USD       US       District of Columbia  Washington, DC area  2 - 4 years    2 - 4 years     MD_Woman         1
                                       Manager (market research - online communities))  66000          NA       USD       USA      Ohio                  Cincinnati           2 - 4 years    2 - 4 years     CD_Woman         1
                                       Manager, Medical Writing                         105,000        11000.0  USD       USA      Pennsylvania          currently remote     8 - 10 years   8 - 10 years    MD_Woman         1
under 18  Retail                       Technology Manager                               100200         12000.0  USD       USA      Virginia              Richmond             21 - 30 years  21 - 30 years   CD_Woman         1
Length: 10991, dtype: int64

In [48]:

import re

In [49]:
# Regular expression to match USA-related countries (case-insensitive)
pattern = r'(?:Unaited States|USA|America)'

In [50]:
# Regular expression to match USA-related countries (case-insensitive)
pattern = r'(?:U?naited? S?tates?|U?S?A?|A?merica|U?\.S?\.|S?tat|u?nited? s?tate|U?S?|U\. S\.|)'

In [51]:
#In"Annual Salary" ,represented by  numerical values,lets find 5 top and  5 minimum salaries
df['Annual Salary'].unique()

array(['55,000', '54,600', '34,000', ..., '7000', '37741', '53060'],
      dtype=object)

In [52]:
# Sort the DataFrame by the column in descending order
#In"Annual Salary" ,represented by  numerical values,lets find 5 top 
df = df.sort_values('Annual Salary',ascending=False)

print(df['Annual Salary'].head())

22298    99952
24428    99850
21764    99780
24498    99600
22626    99500
Name: Annual Salary, dtype: object

In [53]:
print(df['Annual Salary'].tail(50))

2712       100,000
6780       100,000
12966      100,000
18780      100,000
17905      100,000
14643      100,000
17910      100,000
4923       100,000
6772       100,000
485        100,000
17920      100,000
13842      100,000
12947      100,000
9600       100,000
19380      100,000
2107       100,000
11079      100,000
4893       100,000
17952      100,000
17655      100,000
18618          100
26137          100
8592           100
19434       10,800
15191       10,500
14982       10,500
6137        10,000
10827       10,000
5755     1,900,000
6783     1,650,000
16980        1,442
3162     1,400,000
18832    1,360,000
9238     1,334,782
11693    1,324,000
18943    1,300,000
16982    1,300,000
17708    1,260,000
11134    1,200,000
5306     1,200,000
1449     1,150,000
10508    1,150,000
3937     1,150,000
10904    1,100,000
16165    1,100,000
5146     1,100,000
4206     1,100,000
603      1,080,000
20344    1,050,000
19536        1,000
Name: Annual Salary, dtype: object

In [54]:
df_filtered = df[df['Annual Salary'].str.contains (',','.')]
print(df_filtered['Annual Salary'])

14902       99,945
11139       99,840
11636       99,800
18633       99,800
10796       99,750
           ...
5146     1,100,000
4206     1,100,000
603      1,080,000
20344    1,050,000
19536        1,000
Name: Annual Salary, Length: 20302, dtype: object

In [55]:
df['Annual Salary'] = df['Annual Salary'].str.replace(',','').astype(int)

In [56]:
df = df.sort_values('Annual Salary', ascending=False)

print(df['Annual Salary'].head(5))

28055    6000070000
11454     870000000
18984     180000000
27902     120000000
3605      102000000
Name: Annual Salary, dtype: int64

In [57]:
# Assuming Annual Salary can not be less then 1000 , we can not proceed with rows with "NA" and "0"
#take down rows  were Salary<1000

df.drop(df['Annual Salary'].isin(range(100)).index, inplace=True)

In [66]:
print(df['Annual Salary'].tail(5))

Series([], Name: Annual Salary, dtype: int64)

In [59]:
# Determine the distribution of categorical variables (e.g., Industry, Job title, Gender).
# Frequency table for 'Industry'
industry_distribution = df['Industry'].value_counts()

print(industry_distribution)

Series([], Name: Industry, dtype: int64)

In [60]:
# Frequency table for 'Job title
# Frequency table for 'Job title'
Job_distribution = df['Job title'].value_counts()

print(Job_distribution)

Series([], Name: Job title, dtype: int64)

In [61]:
# Frequency table for 'Job title
# Frequency table for 'Job title'
Country_distribution = df['Country'].value_counts()

print(Country_distribution)

Series([], Name: Country, dtype: int64)

In [62]:
from datetime import datetime

In [67]:
# Getting current date and time
current_time = datetime.now()

# Formatting the date and time in a readable format:
formatted_time = current_time.strftime('%B %d, %Y, %H:%M:%S')

In [68]:
# Print the formatted date and time
print(f"Salary_survey_0.ipynb was last run on: {formatted_time}")

Salary_survey_0.ipynb was last run on: November 03, 2024, 01:11:28